app/views/channels/index.html.erb

SELECT `beehive_views`.* FROM `beehive_views` WHERE (view_for='channel' and ancestry is null)
---
          <span class="jump_button">
            <%= select_tag("channel_view_type", options_for_select(BeehiveView.default_channel_views.collect{|chv| [chv['view_name'],chv['id']]}), :data => {:remote => true, :url => get_channels_channels_path}) %>