app/controllers/admin/users_controller.rb

SELECT COUNT(*) FROM `users`
SELECT `users`.* FROM `users` ORDER BY first_name LIMIT 10 OFFSET 0
---
  def index
    @users = User.paginate(:page => params[:page], :per_page => 10)

INSERT INTO `users` (`authentication_token`, `confirmation_sent_at`, `confirmation_token`, `confirmed_at`, `created_at`, `cug_view`, `current_sign_in_at`, `current_sign_in_ip`, `display_name`, `dormant_days`, `dozz_email`, `email`, `encrypted_password`, `first_name`, `is_active`, `is_admin`, `last_name`, `last_sign_in_at`, `last_sign_in_ip`, `remember_created_at`, `remember_token`, `reset_password_sent_at`, `reset_password_token`, `sign_in_count`, `updated_at`) VALUES ('LezfGp6eVSUxTSNWDn6t', '2013-03-01 12:48:26', 'gH6BBxXQg63xs4kPPtjz', NULL, '2013-03-01 12:48:26', 'pv', NULL, NULL, 'smtptest', 2, 'smtptest@mailinator.com', 'smtptest@mailinator.com', '$2a$10$8MAie8GtOq9YXMMq8rXGFeOCyaDCd2yVvhmtjcx68xdfgHp5S46K.', 'smtp', 1, 0, 'test', NULL, NULL, NULL, NULL, NULL, NULL, 0, '2013-03-01 12:48:26')
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 ORDER BY first_name LIMIT 1
---
  def load_user
    @user = User.find params[:id]