app/controllers/buzzs_controller.rb

SELECT `channels`.* FROM `channels` WHERE `channels`.`id` = 246 LIMIT 1
SELECT COUNT(*) FROM `buzzs` WHERE `buzzs`.`channel_id` = 246 AND (user_id != 3 and created_at > '2013-03-01 12:46:04')
SELECT `buzzs`.* FROM `buzzs` WHERE (channel_id = 246) ORDER BY buzzs.id DESC LIMIT 10 OFFSET 0
SELECT `subscriptions`.* FROM `subscriptions` WHERE `subscriptions`.`channel_id` = 246 AND `subscriptions`.`user_id` = 3 LIMIT 1
UPDATE `subscriptions` SET `last_viewed` = '2013-03-01 12:46:04', `updated_at` = '2013-03-01 12:46:04' WHERE `subscriptions`.`id` = 395
---
  def index
    @channel = Channel.find(params[:channel_id])
    if @channel.is_cug
      @buzzs, @last_insync_id = Channel.get_buzzs(@channel.id, current_user.id, "false", 10, params[:page] || 1)
      @buzzs, @last_insync_id =  Channel.get_buzzs(@channel.id, current_user.id, "true", 10, params[:page] || 1) if @buzzs.blank?
    else
      subscription = Subscription.where(:channel_id => @channel.id, :user_id => current_user.id).first
      subscription.update_attributes(:last_viewed => Time.now) if subscription