app/controllers/channels_controller.rb

  def get_channels
    @channels = []
    @beehive_view = BeehiveView.find(params[:channel_view_type])
---
SELECT `beehive_views`.* FROM `beehive_views` WHERE `beehive_views`.`id` = 203 LIMIT 1